In [5]:
# Add matplotlib inline magic command
%matplotlib notebook

# Dependencies and Setup
import matplotlib as plt
import pandas as pd

In [6]:
# Load files
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [17]:
# Read the city data file and store as DataFrame
city_data_df = pd.read_csv(city_data_to_load)

In [51]:
# Read the ride data dile and store as DataFrame
ride_data_df = pd.read_csv(ride_data_to_load)

In [46]:
# Get the columns and the rows that are not null
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [30]:
# Inspect the city data for null values
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [32]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [33]:
# Get the unique values (data points) of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [42]:
# Get the number of data points from Urban cities.
sum(city_data_df["type"] =="Urban")

66

In [43]:
# Get the number of data points from Suburban cities.
sum(city_data_df["type"] =="Suburban")

36

In [44]:
# Get the number of data points from Rural cities.
sum(city_data_df["type"] =="Rural")

18

In [48]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [49]:
# Inspection the ride data for null values
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [52]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [55]:
# Merge data into single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban